# 1. რიცხვები 1-დან 20-მდე და მათი ლუწობა/კენტობა
# ამოცანა: დაბეჭდე რიცხვები 1-დან 20-მდე და მიუწერე თითოეულს, არის თუ არა ლუწი ან კენტი.
for i in range(1,20+1):
    if i % 2 == 0:
        print(str(i) + "არის ლუწი")
    else:
        print(str(i) + "არის კენტი")






# 2. მომხმარებელის მიერ შეყვანილი 5 რიცხვის დადებითი/უარყოფითობა
# ამოცანა: მომხმარებელმა შეიყვანოს 5 რიცხვი. for ციკლით შეამოწმე თითოეული და მიუწერე, არის თუ არა დადებითი, უარყოფითი, თუ ნული.
for i in range(5):
    num = int(input(f"{i+1}-ე რიცხვი: "))
    if num > 0:
        print("დადებითი რიცხვია")
    elif num < 0:
        print("უარყოფითი რიცხვია")
    else:
        print("რიცხვი ნულია")

# 3. 1-დან 50-მდე რიცხვების ფიზბაზის ამოცანა (FizzBuzz)
# ამოცანა: for ციკლით გაიარე 1-დან 50-მდე და:
# თუ რიცხვი იყოფა 3-ზე – დაბეჭდე "Fizz"
# თუ 5-ზე – "Buzz"
# თუ ორივეზე – "FizzBuzz" 
# სხვა შემთხვევაში – დაბეჭდე თვითონ რიცხვი
  
for i in range(1, 51):
    if i % 3 == 0 and i % 5 == 0:
        print("FizzBuzz")
    elif i % 3 == 0:
        print("Fizz")
    elif i % 5 == 0:
        print("Buzz")
    else:
        print(i)



# 4. რიცხვების კატეგორიზაცია: 0–100, კარგი თუ ცუდი ქულა
# ამოცანა: მიცემულია ქულების სია: [45, 78, 89, 55, 20, 99]
# for ციკლით გაიარე და დაბეჭდე:
# თუ ქულა მეტია ან ტოლია 60-ის – "კარგი ქულაა"
# სხვა შემთხვევაში – "სუსტი ქულაა"

scores = [45, 78, 89, 55, 20, 99]

for score in scores:
    if score >= 60:
        print(f"{score} - კარგი ქულაა")
    else:
        print(f"{score} - სუსტი ქულაა")



# 5. სიტყვაში ხმოვნის თუ თანხმოვნის ამოცნობა
# ამოცანა: შეიყვანე სიტყვა. for ციკლით გაიარე თითო ასოზე და მიუწერე, არის თუ არა ის ხმოვანი (ა, ე, ი, ო, უ) თუ თანხმოვანი.

word = input("შეიყვანე სიტყვა: ")
vowels = "აეიოუ"

for letter in word:
    if letter.lower() in vowels:
        print(f"{letter} არის ხმოვანი")
    else:
        print(f"{letter} არის თანხმოვანი")