# 1.დაბეჭდე რიცხვები 1-დან 10-მდე.
for i in range (1,11,1):
    print(i)

# 2.დაბეჭდე ლუწი რიცხვები 2-დან 20-მდე.
for i in range (2,21,2):
    print(i)

# 3.დაბეჭდე კენტი რიცხვები 1-დან 19-მდე.
for i in range (1,20,2):
    print (i)

# 4.დაბეჭდე რიცხვები 10-დან 1-მდე უკუღმა.
for i in range (10 , 0 ,1):
  print (i)

# 5.დაბეჭდე თითოეული ასო სიტყვიდან "banani".
print("b")
print("a")
print("n")
print("a")
print("n")
print("i")

# 6.დაბეჭდე ყველა ასო შენს სახელსა და გვარში.
print("g")
print("i")
print("o")
print("r")
print("g")
print("i")

print("m")
print("a")
print("z")
print("a")
print("n")
print("i")
print("sh")
print("v")
print("i")
print("l")
print("i")

# 7. დაბეჭდე 3-ის ჯერადი რიცხვები 3-დან 30-მდე.
for i in range (3,31,3):
    print(i)

# 8. დაბეჭდე რიცხვების ჯამი 1-დან 100-მდე.
for i in range (1,101,1):
    print(i)

# 9. დაბეჭდე თითოეული ელემენტი სიიდან ["კომპიუტერი", "ტელეფონი", "ტაბლეტი"].
print("Tablet")
print("computer")
print("phone")

# 10. დაბეჭდე რიცხვების კვადრატები 1-დან 10-მდე.
print(1 * 1)
print(2 * 2)
print(3 * 3)
print(4 * 4)
print(5 * 5)
print(6 * 6)
print(7 * 7)
print(8 * 8)
print(9 * 9)  
print(10 * 10)

# 11. დაბეჭდე "Hello" 5-ჯერ.
print("Hello")
print("Hello")
print("Hello")
print("Hello")
print("Hello")

# 12. დაბეჭდე "ვასწავლი პროგრამირებას" 10-ჯერ.
print("ვასწავლი პროგრამირებას")
print("ვასწავლი პროგრამირებას")
print("ვასწავლი პროგრამირებას")
print("ვასწავლი პროგრამირებას")
print("ვასწავლი პროგრამირებას")
print("ვასწავლი პროგრამირებას")
print("ვასწავლი პროგრამირებას")
print("ვასწავლი პროგრამირებას")
print("ვასწავლი პროგრამირებას")
print("ვასწავლი პროგრამირებას")

# 13. დაბეჭდე პირველი 10 ლუწი რიცხვის ნამრავლი.
for i in range (2):
    print(i)

# 14. დაბეჭდე სიტყვა "python" უკუღმა ასო-ასო.
print("n")
print("o")
print("h")
print("t")
print("y")
print("p")

# 15. ჩაწერე 5 სიტყვა სიაში და დაბეჭდე ციკლით.






# 16. დაბეჭდე სიტყვების სიგრძეები სიიდან ["მარილი", "წყალი", "პური"].
print("salt,water,bread")

# 17. დაბეჭდე ციფრები 1-დან 50-მდე, მხოლოდ ისინი რომლებიც 5-ზე იყოფა.
for i in range(1,51,5):
    print(i)

# 18. დაბეჭდე ყველა ასო პატარა ასოებად სიტყვიდან "GEORGIA".
print("g")
print("e")
print("o")
print("r")
print("g")
print("i")
print("a")

 # 19. ჩაწერე ციფრები სიაში და დაბეჭდე თითოეულის ორმაგი მნიშვნელობა.
# დაბეჭდე * სიმბოლო 5 ხაზზე (ხაზზე 10 ცალი ვარსკვლავი). 

