# გადამეორება for loop ( for ციკლი )

for i in range(   1   ,   100  ,  2  ): #   i-სთვის დიაპაზონში( 1 დან , 100მდე , ყოველი მეორე )
            # ( start , finish , step )
            # (სტარტი , ფინიში , ნაბიჯი )

# for - ციკლის შესაქმნელად საჭირო keyword.
# i - საიტერაციო ცვლადი (იტერაცია ნიშნავს განმეორებას), საიტერაციო ცვლადს შეგვიძლია მივანიჭოთ ნებისმიერი სახელი.
# in - ში
# range - დიაპაზონი. 

# range ფუნქციას გადაეცემა 3 არგუმენტი (start, end, step), თუ ჩვენ მას გადავცემთ მხოლოდ ერთ არგუმენტს, იგი ავტომატურად მიიღებს end - ის მნიშვნელობას, start ავტომატურად იქნება 0 - ის ტოლი ხოლო step ავტომატურად იქნება 1 - ის ტოლი


    print(i)  # ვპრინტავთ ჩვენს საინტერაციო ცლადს

# გაითვალისწინე რომ ინდენტაცია თამაშობს დიდი როლს!
# ინდენტაცია - კიდედან დაშორება ( Tab )
