# გადამეორება while loop ( while ციკლი )

i = 0                       # შევქმენით საინტერაციო ცვლადი და მივეცით თავდაპირველი მნიშვნელობა 0 
                            # რადგან ჩვენმა while ციკლმა ათვლა დაიწყოს 0 - დან

while i < 100 :             # სანამ ჩვენი საინტერაციო ცვლადი ნაკლებია 100-ზე იქამდე:
    
    print(i)                # პრინტე ჩვენი საინტერაციო ცვლადი

    i = i + 1               # შემდეგ ჩვენს საინტერაციო ცვლადს შევუცვალეთ მნიშვნელობა 
                            # რადგან ყოველ ნაბიჯზე ემაპებოდეს 1 იმიტომ რომ ამის გარეშე 
                            # ჩვენი საინტერაციო ცვლადი სულ იქნება 0 ანუ 100ზე ნაკლები რიცხვი 
                            # ამიტომაც ტერმინალში დაგვეპრინტება 0 უსასრულოდ

# i - საიტერაციო ცვლადის დეკლარაცია.
# while - ციკლის შესაქმნელად საჭირო keyword. (სანამ)
# ჩვენს შემთხვევაში ციკლი იმუშავებს მანამდე სანამ i ნაკლებია 100-ზე.
# თითოეულ დატრიალებაზე დაიპრინტება საიტერაციო ცვლადი (i), რომელიც ყოველ გამეორებაზე იცვლის მნიშვნელობას.
# i = i + 1 - ეს არის საიტერაციო ცვლადის ინკრემენტაცია (გაზრდა) შეგვიძლია მოკლედ ასე ჩავწეროტ i += 1


# გაითვალისწინე რომ ინდენტაცია თამაშობს დიდი როლს!
# ინდენტაცია - კიდედან დაშორება ( Tab )