# 2) შექმენით 4 ცვლადი თითოეულ მათგანს მნიშვნელობად მიანიჭეთ განსხავებული რიცხვები შემდეგ კი ამ რიცხვებით რომლებსაც ინახავთ ცვლადებში ყველა შესაძლო კომბინაციით შეასრულეთ ოთხი მათემატიკური მოქმედება: მიმატება, გამოკლება, გამრავლება, გაყოფა ისე რომ დაიბეჭდოს თვითონ მოქმედება და პასუხი მაგ. ავიღოთ ორი რიცხვი 3 და 4 ამ ორი რიცხვის შემთხვევაში შედექი იქნება 3 + 4 = 7 , 3 - 4 = -1 და ასე შემდეგ ყველა შესაძლო რიცხვების კომბინაციით და მოქმედებით, რეალური მაგალითი გავაკეთეთ გაკვეთილზე


gela = 1
gio = 2 
saba = 4
nika = 8

# 1 + 2 = 3
# 1 + 4 = 5
# 1 + 8 = 9

print(str(gela) + " + " + str(gio) + " = "  + str(gela + gio))
print(str(gela) + " + " + str(saba) + " = " + str(gela + saba))
print(str(gela) + " + " + str(nika) + " = " + str(gela + nika))

# 2 - 1 = 5
# 4 - 1 = 9
# 8 - 1 = 3

print(str(gio)  +  " - " + str(gela) +  " = "  +  str(gio-gela))
print(str(saba) +  " - " + str(gela) +  " = " +  str(saba-gela))
print(str(nika) +  " - " + str(gela) + " = " + str(nika-gela ))






