#ციკლები!

#ციკლი არის ერთი და იგივე ოპერაციის შესრულება რამდენჯერმე.

# for i in range(1,20,2):
#     print(i)

    # for ციკლის შესაქმნელად საჭირო keyword.
    # i - საიტერაციო ცვლადი (იტერაცია ნიშნავს განმეორებას), საიტერაციო ცვლადს შეგვიძლია მივანიჭოთ ნებისმიერი სახელი.
    # in - ში
    # range - დიაპაზონი. 
    # range ფუნქციას გადაეცემა 3 არგუმენტი (start, end, step), თუ ჩვენ მას გადავცემთ მხოლოდ ერთ არგუმენტს, იგი ავტომატურად მიიღებს end - ის მნიშვნელობას, start ავტომატურად იქნება 0 - ის ტოლი ხოლო step ავტომატურად იქნება 1 - ის ტოლი




    