# 1.დაბეჭდე რიცხვები 1-დან 10-მდე.

for i in range (1,11,1):
    print(i)

# 2.დაბეჭდე ლუწი რიცხვები 2-დან 20-მდე.

for i in range (2,21,2):
    print(i)

# 3.დაბეჭდე კენტი რიცხვები 1-დან 19-მდე.

for i in range (1,20,2):
   print (i)

# 4.დაბეჭდე რიცხვები 10-დან 1-მდე უკუღმა.

for i in range (10 , 0 ,1):
  print (i)

# 5.დაბეჭდე თითოეული ასო სიტყვიდან "banani".

sityva = "banani"
for i in sityva:
    print(i)

# 6.დაბეჭდე ყველა ასო შენს სახელსა და გვარში.

name = "giorgi mazanishvili"
for i in name:
    print(i)

# 7. დაბეჭდე 3-ის ჯერადი რიცხვები 3-დან 30-მდე.

for i in range (3,31,3):
    print(i)

# 8. დაბეჭდე რიცხვების ჯამი 1-დან 100-მდე.

for i in range (1,101,1):
    print(i)

# 9. დაბეჭდე თითოეული ელემენტი სიიდან ["კომპიუტერი", "ტელეფონი", "ტაბლეტი"].

list=["კომპიუტერი", "ტელეფონი", "ტაბლეტი"]
for i in list:
    print(i)

# 10. დაბეჭდე რიცხვების კვადრატები 1-დან 10-მდე.

for i in range(1,10+1):
    print(i**2)
    
# 11. დაბეჭდე "Hello" 5-ჯერ.

for i in range(5+1):
    print("Hello")

# 12. დაბეჭდე "ვასწავლი პროგრამირებას" 10-ჯერ.

for i in range(10+1):
    print("ვასწავლი პროგრამირებას")

# 13. დაბეჭდე პირველი 10 ლუწი რიცხვის ნამრავლი.

for i in range (10+1):
    if i % 2 == 0:
        i*=i
print(i)

# 14. დაბეჭდე სიტყვა "python" უკუღმა ასო-ასო.

sityva = "nohtyp"
for i in sityva:
    print(i)

# 15. ჩაწერე 5 სიტყვა სიაში და დაბეჭდე ციკლით.

list = ["მარილი", "წყალი", "პური", "ბანანი" , "გიორგი"]
for i in list:
   print(i)

# 16. დაბეჭდე სიტყვების სიგრძეები სიიდან ["მარილი", "წყალი", "პური"].

list = ["მარილი", "წყალი", "პური"]

print(len(list))

# 17. დაბეჭდე ციფრები 1-დან 50-მდე, მხოლოდ ისინი რომლებიც 5-ზე იყოფა.

for i in range(1,51,5):
     print(i)

# 18. დაბეჭდე ყველა ასო პატარა ასოებად სიტყვიდან "GEORGIA".

sityva = "GEORGIA"
for i in sityva:
    print(i.lower())

# 19. ჩაწერე ციფრები სიაში და დაბეჭდე თითოეულის ორმაგი მნიშვნელობა.

numbers = [1, 3, 5, 7, 9]

for number in numbers:
    print(number * 2)

# 20 .დაბეჭდე * სიმბოლო 5 ხაზზე (ხაზზე 10 ცალი ვარსკვლავი)

for i in range(5):
    print("*" * 10) 