#inputs and outputs

name = input("რამდენი წლის ხართ ? : ")
print("შენ ხარ " + name + " წლის")

question1 = input("რა არის შენი სახელი? : ")
question2 = input("რამდენი წლის ხარ? : ")

print("შენი სახელია " + question1 + " და შენ ხარ " + question2 + " წლის")

# Class work
# საკლასო დავალების პირობა: შექმენით 4 კითხვა input-ების გამოყენებით, ეს კითხვებია:
# 1. რა არის შენი სახელი?
# 2. რა არის შენი გვარი?
# 3. რამდენი წლის ხარ?
# 4. რა არის შენი ჰობი?

# და ტერმინალში გამოიტანეთ შემდეგი ტექსტი:

# შენი სახელია (სახელი) (გვარი) შენ ხარ (წლოვანება) წლის და შენი ჰობია (ჰობი)
question1=input("რა არის შენი სახელი? : ")
question2=input("რა არის შენი გვარი? : ")
question3=input("რამდენი წლის ხარ? : ")
question4=input("რა არის შენი ჰობი? : ")
print("შენი სახელია " + question1 + " " + question2 + " შენ ხარ " + question3 + " წლის და შენი ჰობია " + question4)


